logs/facebook-socfb-no-HTP/dsb-result_node5_threads48_conn200_mixed-workload_network_facebook-mode-numa-membind-0.log

CONFIG: node:5 threads:48 conn:200 workload:mixed-workload network:facebook RPS:1000 numa-config:numa-membind-0
*************************************************************
Running 2m test @ http://localhost:8080
  48 threads and 200 connections

  Thread calibration: mean lat.: 9.285ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.155ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.361ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.329ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.506ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.159ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.187ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.690ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.193ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.442ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.340ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.256ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.519ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.554ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.340ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 8.929ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 9.081ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.460ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.556ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.498ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.446ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.684ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.515ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.180ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.378ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.334ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.343ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.446ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 8.963ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.284ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.414ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.400ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.188ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.788ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.553ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.213ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.079ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.502ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.578ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.454ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.399ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.556ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 8.901ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.450ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.364ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.323ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.292ms, rate sampling interval: 23ms
  Thread calibration: mean lat.: 9.590ms, rate sampling interval: 25ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.35ms    2.42ms  16.45ms   71.82%
    Req/Sec    20.28     29.35   125.00     91.53%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.19ms
 75.000%   10.73ms
 90.000%   12.32ms
 99.000%   16.45ms
 99.900%   21.49ms
 99.990%   26.61ms
 99.999%   36.48ms
100.000%   44.96ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.753     0.000000            1         1.00
       6.455     0.100000        10593         1.11
       7.419     0.200000        21195         1.25
       8.079     0.300000        31788         1.43
       8.647     0.400000        42349         1.67
       9.191     0.500000        53038         2.00
       9.471     0.550000        58352         2.22
       9.751     0.600000        63573         2.50
      10.055     0.650000        68867         2.86
      10.375     0.700000        74077         3.33
      10.735     0.750000        79424         4.00
      10.935     0.775000        82084         4.44
      11.143     0.800000        84724         5.00
      11.383     0.825000        87390         5.71
      11.647     0.850000        89997         6.67
      11.951     0.875000        92596         8.00
      12.135     0.887500        93970         8.89
      12.319     0.900000        95255        10.00
      12.543     0.912500        96574        11.43
      12.791     0.925000        97913        13.33
      13.079     0.937500        99209        16.00
      13.247     0.943750        99881        17.78
      13.431     0.950000       100538        20.00
      13.663     0.956250       101196        22.86
      13.903     0.962500       101860        26.67
      14.207     0.968750       102525        32.00
      14.375     0.971875       102857        35.56
      14.583     0.975000       103180        40.00
      14.823     0.978125       103510        45.71
      15.151     0.981250       103846        53.33
      15.487     0.984375       104172        64.00
      15.687     0.985938       104339        71.11
      15.935     0.987500       104502        80.00
      16.239     0.989062       104666        91.43
      16.575     0.990625       104830       106.67
      16.975     0.992188       105003       128.00
      17.167     0.992969       105080       142.22
      17.407     0.993750       105163       160.00
      17.679     0.994531       105247       182.86
      17.967     0.995313       105327       213.33
      18.319     0.996094       105409       256.00
      18.527     0.996484       105452       284.44
      18.863     0.996875       105492       320.00
      19.151     0.997266       105533       365.71
      19.503     0.997656       105575       426.67
      20.031     0.998047       105616       512.00
      20.447     0.998242       105638       568.89
      20.671     0.998437       105657       640.00
      20.927     0.998633       105678       731.43
      21.183     0.998828       105699       853.33
      21.567     0.999023       105719      1024.00
      21.807     0.999121       105729      1137.78
      22.079     0.999219       105740      1280.00
      22.335     0.999316       105750      1462.86
      22.479     0.999414       105760      1706.67
      22.975     0.999512       105771      2048.00
      23.263     0.999561       105776      2275.56
      23.487     0.999609       105781      2560.00
      23.647     0.999658       105787      2925.71
      24.191     0.999707       105791      3413.33
      24.575     0.999756       105797      4096.00
      24.831     0.999780       105799      4551.11
      24.895     0.999805       105803      5120.00
      25.055     0.999829       105804      5851.43
      25.727     0.999854       105807      6826.67
      26.511     0.999878       105810      8192.00
      26.607     0.999890       105811      9102.22
      26.863     0.999902       105812     10240.00
      27.103     0.999915       105813     11702.86
      27.679     0.999927       105815     13653.33
      28.287     0.999939       105816     16384.00
      29.487     0.999945       105817     18204.44
      29.487     0.999951       105817     20480.00
      29.551     0.999957       105818     23405.71
      31.807     0.999963       105819     27306.67
      31.807     0.999969       105819     32768.00
      32.207     0.999973       105820     36408.89
      32.207     0.999976       105820     40960.00
      32.207     0.999979       105820     46811.43
      36.479     0.999982       105821     54613.33
      36.479     0.999985       105821     65536.00
      36.479     0.999986       105821     72817.78
      36.479     0.999988       105821     81920.00
      36.479     0.999989       105821     93622.86
      44.959     0.999991       105822    109226.67
      44.959     1.000000       105822          inf
#[Mean    =        9.354, StdDeviation   =        2.418]
#[Max     =       44.928, Total count    =       105822]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  115316 requests in 2.00m, 1.40GB read
Requests/sec:    960.89  
Transfer/sec:     11.98MB
*************************************************************

CONFIG: node:5 threads:48 conn:200 workload:mixed-workload network:facebook RPS:5000 numa-config:numa-membind-0
*************************************************************
Running 2m test @ http://localhost:8080
  48 threads and 200 connections

  Thread calibration: mean lat.: 6.456ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.575ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.794ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.646ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.567ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.875ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.756ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 7.052ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.699ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.601ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.551ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.387ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.625ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.463ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.610ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.560ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.472ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.668ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.581ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.592ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.593ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.810ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.307ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.714ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.373ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.639ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.668ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.960ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.857ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.498ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.679ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.687ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.719ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.697ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.353ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.231ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.710ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.853ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.372ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.476ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.631ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.548ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.570ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.615ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.764ms, rate sampling interval: 19ms
  Thread calibration: mean lat.: 6.222ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.446ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.778ms, rate sampling interval: 20ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.57ms    2.23ms  14.33ms   77.99%
    Req/Sec   106.68     76.09   315.00     71.61%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.04ms
 75.000%    7.46ms
 90.000%    9.42ms
 99.000%   14.33ms
 99.900%   19.41ms
 99.990%   26.11ms
 99.999%   36.19ms
100.000%   40.48ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.493     0.000000            1         1.00
       4.411     0.100000        55188         1.11
       4.863     0.200000       110310         1.25
       5.251     0.300000       165280         1.43
       5.631     0.400000       220175         1.67
       6.039     0.500000       275153         2.00
       6.259     0.550000       302334         2.22
       6.503     0.600000       329792         2.50
       6.775     0.650000       357381         2.86
       7.087     0.700000       384666         3.33
       7.459     0.750000       412284         4.00
       7.675     0.775000       425943         4.44
       7.919     0.800000       439601         5.00
       8.207     0.825000       453569         5.71
       8.535     0.850000       467127         6.67
       8.935     0.875000       480913         8.00
       9.167     0.887500       487851         8.89
       9.423     0.900000       494509        10.00
       9.719     0.912500       501423        11.43
      10.055     0.925000       508311        13.33
      10.455     0.937500       515218        16.00
      10.679     0.943750       518575        17.78
      10.927     0.950000       521992        20.00
      11.207     0.956250       525453        22.86
      11.543     0.962500       528893        26.67
      11.935     0.968750       532341        32.00
      12.143     0.971875       534024        35.56
      12.383     0.975000       535715        40.00
      12.663     0.978125       537460        45.71
      12.991     0.981250       539156        53.33
      13.391     0.984375       540879        64.00
      13.615     0.985938       541748        71.11
      13.847     0.987500       542599        80.00
      14.127     0.989062       543450        91.43
      14.463     0.990625       544315       106.67
      14.855     0.992188       545174       128.00
      15.071     0.992969       545590       142.22
      15.319     0.993750       546017       160.00
      15.631     0.994531       546452       182.86
      15.983     0.995313       546882       213.33
      16.383     0.996094       547305       256.00
      16.607     0.996484       547533       284.44
      16.847     0.996875       547740       320.00
      17.135     0.997266       547956       365.71
      17.439     0.997656       548165       426.67
      17.855     0.998047       548378       512.00
      18.095     0.998242       548488       568.89
      18.351     0.998437       548598       640.00
      18.687     0.998633       548704       731.43
      19.039     0.998828       548810       853.33
      19.471     0.999023       548915      1024.00
      19.791     0.999121       548970      1137.78
      20.079     0.999219       549024      1280.00
      20.399     0.999316       549076      1462.86
      20.847     0.999414       549130      1706.67
      21.183     0.999512       549183      2048.00
      21.487     0.999561       549212      2275.56
      21.727     0.999609       549238      2560.00
      21.919     0.999658       549264      2925.71
      22.335     0.999707       549293      3413.33
      22.975     0.999756       549317      4096.00
      23.279     0.999780       549331      4551.11
      23.583     0.999805       549344      5120.00
      23.967     0.999829       549358      5851.43
      24.479     0.999854       549371      6826.67
      25.535     0.999878       549384      8192.00
      25.935     0.999890       549391      9102.22
      26.207     0.999902       549398     10240.00
      26.495     0.999915       549405     11702.86
      26.847     0.999927       549411     13653.33
      27.231     0.999939       549418     16384.00
      27.711     0.999945       549421     18204.44
      28.399     0.999951       549425     20480.00
      28.655     0.999957       549428     23405.71
      29.279     0.999963       549431     27306.67
      30.335     0.999969       549435     32768.00
      30.431     0.999973       549436     36408.89
      30.655     0.999976       549438     40960.00
      31.215     0.999979       549440     46811.43
      31.519     0.999982       549441     54613.33
      32.319     0.999985       549443     65536.00
      35.423     0.999986       549444     72817.78
      35.743     0.999988       549445     81920.00
      36.191     0.999989       549446     93622.86
      36.191     0.999991       549446    109226.67
      36.959     0.999992       549447    131072.00
      37.727     0.999993       549448    145635.56
      37.727     0.999994       549448    163840.00
      38.623     0.999995       549449    187245.71
      38.623     0.999995       549449    218453.33
      38.623     0.999996       549449    262144.00
      38.655     0.999997       549450    291271.11
      38.655     0.999997       549450    327680.00
      38.655     0.999997       549450    374491.43
      38.655     0.999998       549450    436906.67
      38.655     0.999998       549450    524288.00
      40.479     0.999998       549451    582542.22
      40.479     1.000000       549451          inf
#[Mean    =        6.567, StdDeviation   =        2.226]
#[Max     =       40.448, Total count    =       549451]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  599170 requests in 2.00m, 7.33GB read
Requests/sec:   4996.49  
Transfer/sec:     62.57MB
*************************************************************

CONFIG: node:5 threads:48 conn:200 workload:mixed-workload network:facebook RPS:10000 numa-config:numa-membind-0
*************************************************************
Running 2m test @ http://localhost:8080
  48 threads and 200 connections

  Thread calibration: mean lat.: 1149.023ms, rate sampling interval: 5582ms
  Thread calibration: mean lat.: 1818.012ms, rate sampling interval: 6823ms
  Thread calibration: mean lat.: 1261.182ms, rate sampling interval: 4665ms
  Thread calibration: mean lat.: 950.373ms, rate sampling interval: 3940ms
  Thread calibration: mean lat.: 1321.974ms, rate sampling interval: 6942ms
  Thread calibration: mean lat.: 1277.899ms, rate sampling interval: 4866ms
  Thread calibration: mean lat.: 1156.237ms, rate sampling interval: 5947ms
  Thread calibration: mean lat.: 1021.826ms, rate sampling interval: 4440ms
  Thread calibration: mean lat.: 2062.680ms, rate sampling interval: 8527ms
  Thread calibration: mean lat.: 1318.462ms, rate sampling interval: 5414ms
  Thread calibration: mean lat.: 1114.122ms, rate sampling interval: 6811ms
  Thread calibration: mean lat.: 1449.504ms, rate sampling interval: 6115ms
  Thread calibration: mean lat.: 1379.907ms, rate sampling interval: 4939ms
  Thread calibration: mean lat.: 1003.045ms, rate sampling interval: 4292ms
  Thread calibration: mean lat.: 875.785ms, rate sampling interval: 4218ms
  Thread calibration: mean lat.: 1748.608ms, rate sampling interval: 6762ms
  Thread calibration: mean lat.: 1533.875ms, rate sampling interval: 6651ms
  Thread calibration: mean lat.: 1120.770ms, rate sampling interval: 5165ms
  Thread calibration: mean lat.: 1336.629ms, rate sampling interval: 5324ms
  Thread calibration: mean lat.: 1299.903ms, rate sampling interval: 5197ms
  Thread calibration: mean lat.: 935.594ms, rate sampling interval: 4845ms
  Thread calibration: mean lat.: 993.807ms, rate sampling interval: 6520ms
  Thread calibration: mean lat.: 873.124ms, rate sampling interval: 3264ms
  Thread calibration: mean lat.: 923.780ms, rate sampling interval: 4980ms
  Thread calibration: mean lat.: 1276.622ms, rate sampling interval: 6733ms
  Thread calibration: mean lat.: 860.272ms, rate sampling interval: 3717ms
  Thread calibration: mean lat.: 729.138ms, rate sampling interval: 3405ms
  Thread calibration: mean lat.: 1664.911ms, rate sampling interval: 7155ms
  Thread calibration: mean lat.: 1026.515ms, rate sampling interval: 4304ms
  Thread calibration: mean lat.: 1632.098ms, rate sampling interval: 6864ms
  Thread calibration: mean lat.: 2037.021ms, rate sampling interval: 7090ms
  Thread calibration: mean lat.: 720.105ms, rate sampling interval: 4075ms
  Thread calibration: mean lat.: 814.873ms, rate sampling interval: 4337ms
  Thread calibration: mean lat.: 593.071ms, rate sampling interval: 3117ms
  Thread calibration: mean lat.: 1364.801ms, rate sampling interval: 4808ms
  Thread calibration: mean lat.: 1433.794ms, rate sampling interval: 4972ms
  Thread calibration: mean lat.: 1264.211ms, rate sampling interval: 6459ms
  Thread calibration: mean lat.: 1523.108ms, rate sampling interval: 5931ms
  Thread calibration: mean lat.: 1329.135ms, rate sampling interval: 4632ms
  Thread calibration: mean lat.: 1028.933ms, rate sampling interval: 5091ms
  Thread calibration: mean lat.: 870.928ms, rate sampling interval: 5320ms
  Thread calibration: mean lat.: 1459.509ms, rate sampling interval: 5804ms
  Thread calibration: mean lat.: 814.262ms, rate sampling interval: 3870ms
  Thread calibration: mean lat.: 2041.962ms, rate sampling interval: 7446ms
  Thread calibration: mean lat.: 771.572ms, rate sampling interval: 4665ms
  Thread calibration: mean lat.: 729.022ms, rate sampling interval: 3885ms
  Thread calibration: mean lat.: 843.893ms, rate sampling interval: 3319ms
  Thread calibration: mean lat.: 1270.580ms, rate sampling interval: 4089ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.96s    12.81s    0.90m    69.74%
    Req/Sec   153.23     15.43   180.00     70.46%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.84s 
 75.000%   23.51s 
 90.000%   34.54s 
 99.000%    0.90m 
 99.900%    1.10m 
 99.990%    1.18m 
 99.999%    1.19m 
100.000%    1.19m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.215     0.000000            1         1.00
    2185.215     0.100000        79537         1.11
    4583.423     0.200000       159078         1.25
    7118.847     0.300000       238619         1.43
    9854.975     0.400000       318110         1.67
   12836.863     0.500000       397600         2.00
   14393.343     0.550000       437484         2.22
   16228.351     0.600000       477191         2.50
   18317.311     0.650000       517095         2.86
   20742.143     0.700000       556685         3.33
   23511.039     0.750000       596529         4.00
   24920.063     0.775000       616448         4.44
   26378.239     0.800000       636296         5.00
   27951.103     0.825000       656020         5.71
   29868.031     0.850000       676023         6.67
   32145.407     0.875000       695769         8.00
   33325.055     0.887500       705787         8.89
   34537.471     0.900000       715660        10.00
   35946.495     0.912500       725749        11.43
   37453.823     0.925000       735527        13.33
   39288.831     0.937500       745555        16.00
   40271.871     0.943750       750539        17.78
   41353.215     0.950000       755432        20.00
   42532.863     0.956250       760421        22.86
   43843.583     0.962500       765435        26.67
   45350.911     0.968750       770377        32.00
   46170.111     0.971875       772809        35.56
   46989.311     0.975000       775304        40.00
   47841.279     0.978125       777798        45.71
   48955.391     0.981250       780267        53.33
   50397.183     0.984375       782782        64.00
   51216.383     0.985938       783989        71.11
   52068.351     0.987500       785252        80.00
   52953.087     0.989062       786494        91.43
   54198.271     0.990625       787744       106.67
   55607.295     0.992188       788970       128.00
   56590.335     0.992969       789588       142.22
   57671.679     0.993750       790211       160.00
   58523.647     0.994531       790822       182.86
   59539.455     0.995313       791437       213.33
   60784.639     0.996094       792066       256.00
   61407.231     0.996484       792380       284.44
   62062.591     0.996875       792683       320.00
   62717.951     0.997266       792997       365.71
   63406.079     0.997656       793316       426.67
   64192.511     0.998047       793618       512.00
   64552.959     0.998242       793770       568.89
   64913.407     0.998437       793928       640.00
   65273.855     0.998633       794090       731.43
   65699.839     0.998828       794232       853.33
   66322.431     0.999023       794394      1024.00
   66682.879     0.999121       794471      1137.78
   67043.327     0.999219       794541      1280.00
   67567.615     0.999316       794630      1462.86
   67960.831     0.999414       794704      1706.67
   68419.583     0.999512       794779      2048.00
   68681.727     0.999561       794817      2275.56
   68943.871     0.999609       794856      2560.00
   69206.015     0.999658       794893      2925.71
   69533.695     0.999707       794946      3413.33
   69730.303     0.999756       794973      4096.00
   69926.911     0.999780       794993      4551.11
   70123.519     0.999805       795011      5120.00
   70320.127     0.999829       795030      5851.43
   70451.199     0.999854       795048      6826.67
   70582.271     0.999878       795065      8192.00
   70713.343     0.999890       795085      9102.22
   70713.343     0.999902       795085     10240.00
   70909.951     0.999915       795101     11702.86
   70975.487     0.999927       795105     13653.33
   71172.095     0.999939       795115     16384.00
   71303.167     0.999945       795122     18204.44
   71368.703     0.999951       795124     20480.00
   71434.239     0.999957       795134     23405.71
   71434.239     0.999963       795134     27306.67
   71499.775     0.999969       795143     32768.00
   71499.775     0.999973       795143     36408.89
   71499.775     0.999976       795143     40960.00
   71565.311     0.999979       795150     46811.43
   71565.311     0.999982       795150     54613.33
   71565.311     0.999985       795150     65536.00
   71630.847     0.999986       795156     72817.78
   71630.847     0.999988       795156     81920.00
   71630.847     0.999989       795156     93622.86
   71630.847     0.999991       795156    109226.67
   71630.847     0.999992       795156    131072.00
   71696.383     0.999993       795162    145635.56
   71696.383     1.000000       795162          inf
#[Mean    =    15962.936, StdDeviation   =    12811.192]
#[Max     =    71630.848, Total count    =       795162]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  868039 requests in 2.00m, 10.62GB read
Requests/sec:   7239.78  
Transfer/sec:     90.74MB
*************************************************************